test/minikube-overheads/results/aqua-sysbench/postgres-gvisor
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            279048
        write:                           79728
        other:                           39864
        total:                           398640
    transactions:                        19932  (166.10 per sec.)
    queries:                             398640 (3321.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0022s
    total number of events:              19932

Latency (ms):
         min:                                    5.14
         avg:                                    6.02
         max:                                   23.43
         99th percentile:                        9.22
         sum:                               119988.15

Threads fairness:
    events (avg/stddev):           19932.0000/0.00
    execution time (avg/stddev):   119.9881/0.00