test/minikube-overheads/results/aqua-sysbench/postgres-gvisor-p50
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            189812
        write:                           54232
        other:                           27116
        total:                           271160
    transactions:                        13558  (112.98 per sec.)
    queries:                             271160 (2259.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0016s
    total number of events:              13558

Latency (ms):
         min:                                    7.01
         avg:                                    8.85
         max:                                   54.25
         50th percentile:                        8.58
         sum:                               119991.80

Threads fairness:
    events (avg/stddev):           13558.0000/0.00
    execution time (avg/stddev):   119.9918/0.00