test/minikube-overheads/results/aqua-sysbench/postgres-gvisor-p90
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            187026
        write:                           53436
        other:                           26718
        total:                           267180
    transactions:                        13359  (111.32 per sec.)
    queries:                             267180 (2226.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0083s
    total number of events:              13359

Latency (ms):
         min:                                    7.62
         avg:                                    8.98
         max:                                   59.87
         90th percentile:                        9.56
         sum:                               119998.01

Threads fairness:
    events (avg/stddev):           13359.0000/0.00
    execution time (avg/stddev):   119.9980/0.00