test/minikube-overheads/results/aqua-sysbench/postgres-gvisor-p99
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            271712
        write:                           77632
        other:                           38816
        total:                           388160
    transactions:                        19408  (161.72 per sec.)
    queries:                             388160 (3234.48 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0064s
    total number of events:              19408

Latency (ms):
         min:                                    5.10
         avg:                                    6.18
         max:                                   42.80
         99th percentile:                       10.65
         sum:                               119993.43

Threads fairness:
    events (avg/stddev):           19408.0000/0.00
    execution time (avg/stddev):   119.9934/0.00