test/minikube-overheads/results/aqua-sysbench/postgres-qemu-p50
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            308504
        write:                           88144
        other:                           44072
        total:                           440720
    transactions:                        22036  (183.63 per sec.)
    queries:                             440720 (3672.61 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0015s
    total number of events:              22036

Latency (ms):
         min:                                    4.34
         avg:                                    5.45
         max:                                   23.94
         50th percentile:                        5.37
         sum:                               119988.79

Threads fairness:
    events (avg/stddev):           22036.0000/0.00
    execution time (avg/stddev):   119.9888/0.00