test/minikube-overheads/results/aqua-sysbench/postgres-qemu-p90
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            310044
        write:                           88584
        other:                           44292
        total:                           442920
    transactions:                        22146  (184.55 per sec.)
    queries:                             442920 (3690.98 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0003s
    total number of events:              22146

Latency (ms):
         min:                                    4.27
         avg:                                    5.42
         max:                                   87.73
         90th percentile:                        5.88
         sum:                               119987.19

Threads fairness:
    events (avg/stddev):           22146.0000/0.00
    execution time (avg/stddev):   119.9872/0.00