test/minikube-overheads/results/aqua-sysbench/postgres-qemu-p99
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            308000
        write:                           88000
        other:                           44000
        total:                           440000
    transactions:                        22000  (183.32 per sec.)
    queries:                             440000 (3666.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0061s
    total number of events:              22000

Latency (ms):
         min:                                    4.00
         avg:                                    5.45
         max:                                   93.76
         99th percentile:                        9.06
         sum:                               119992.95

Threads fairness:
    events (avg/stddev):           22000.0000/0.00
    execution time (avg/stddev):   119.9929/0.00